backend/app/controllers/drink_orders_controller.rb

    def index
        @drink_orders = DrinkOrder.all
---
SELECT "drink_orders".* FROM "drink_orders"