backend/app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
---
    def index
        @drinks = Drink.all