backend/app/controllers/orders_controller.rb

class OrdersController < ApplicationController
    before_action :authorized, only: [:create

    def create
        @new_order = Order.create(user: @user)

        params[:drink_ids].each do |drink_id|
            DrinkOrder.create(drink_id: drink_id, order: @new_order, topping: "Tapoica" , size: "Medium")
        end

        render json: @new_order
    end

end

---
SELECT "drink_orders".* FROM "drink_orders" WHERE "drink_orders"."order_id" = $1  [["order_id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-05-07 16:55:38.113189"], ["updated_at", "2020-05-07 16:55:38.113189"]]
INSERT INTO "drink_orders" ("topping", "size", "drink_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["topping", "Tapoica"], ["size", "Medium"], ["drink_id", 1], ["order_id", 1], ["created_at", "2020-05-07 16:55:38.143648"], ["updated_at", "2020-05-07 16:55:38.143648"]]